src/main/resources/xmls/salesforcequery/CreateStrategicOpportunityRequest2.xml

<?xml version="1.0" encoding="UTF-8"?>

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"

	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">

	<Header>

		<SessionHeader xmlns="urn:partner.soap.sforce.com">

			<sessionId></sessionId>

		</SessionHeader>

	</Header>

	<Body>

		<create xmlns="urn:partner.soap.sforce.com">

			<sObjects>

				<type xmlns="urn:sobject.partner.soap.sforce.com">Opportunity</type>
				<Name xmlns="">test</Name>
				<CloseDate xmlns=""></CloseDate>
				<StageName xmlns=""></StageName>
				<Req_Worksite_City__c xmlns=""></Req_Worksite_City__c>
				<Req_Worksite_Country__c xmlns=""></Req_Worksite_Country__c>
				<Req_Worksite_Street__c xmlns=""></Req_Worksite_Street__c>
				<Req_Worksite_Postal_Code__c xmlns=""></Req_Worksite_Postal_Code__c>
				<Req_Worksite_State__c xmlns=""></Req_Worksite_State__c>
				<AccountId xmlns=""></AccountId>
				<OpCo__c xmlns=""></OpCo__c>
				<RecordTypeId xmlns=""></RecordTypeId>
				<Impacted_Regions__c xmlns=""></Impacted_Regions__c>
				<Response_Type__c xmlns=""></Response_Type__c>
				<BusinessUnit__c xmlns=""></BusinessUnit__c>
				<Description xmlns=""></Description>
				<Amount xmlns=""></Amount>
				<Number_of_Resources__c xmlns=""></Number_of_Resources__c>
				<Location__c xmlns=""></Location__c>
				<DeliveryModel__c xmlns=""></DeliveryModel__c>
				<Average_Bill_Rates__c xmlns=""></Average_Bill_Rates__c>
				<Start_Date__c xmlns=""></Start_Date__c>
				<Project_Length_Duration_Weeks__c xmlns=""></Project_Length_Duration_Weeks__c>
				<Win_Loss_Wash_reason__c xmlns=""></Win_Loss_Wash_reason__c>
				<Pricing_Billing_Type__c xmlns=""></Pricing_Billing_Type__c>
				<Product__c xmlns=""></Product__c>
			</sObjects>

		</create>

	</Body>

</Envelope>